meeting/minutes/2023/01-10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 017 Minutes 2023-01-10</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 017 Minutes 2023-01-10</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/17]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[10/14]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[1/14]</code></a></li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical Agenda</a>
<ul>
<li><a href="#h-EF7A6EB3-0BDC-4E8E-A805-8461FD43964C">2.1. Issue #281, reopened as #299</a></li>
<li><a href="#pr-parse-html">2.2. Review pull request #259: parse-html (issue #74)</a></li>
<li><a href="#pr-fn-char">2.3. Review pull request #261: fn:char (issue #121)</a></li>
<li><a href="#pr-grammar-if-then-else">2.4. Review pull request #284: Grammar for if-then w/o else</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/17]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-015-02: NW to improve the width of the diagrams, perhaps multiple views</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-015-03: NW to make sure the direction of the arrow is in the legend</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-015-04: NW to investigate of a dynamic presentation is practical</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-02: NW to add an ed-note indicating when it was approved.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-03: RD to add a note clarifying “known character encoding”</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-04: RD to add a note clarifying the “*”/”*” html/version combination</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-05: RD to add a “todo” noting the dependency on keyword arguments</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-06: RD to reword the introduction to mapping to clarify who’s doing the mapping</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-07: NW to make an issue about the problems of document-uri uniqueness</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-08: RD to clarify how namespace comparisons are performed.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-09: RD to add a note stating that the local name should always be lowercase</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-10: RD to consider how to clarify <i>parsed</i> entity parsing.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-017-01: MK to clarify the characters numbers in points 1 and 2 of fn:char</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-017-02: MK to change the order of points to 3, 4, 1, 2 in fn:char</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-017-03: SF to follow up on whether or not the browser has all the Unicode and emoji names.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-017-04: MK to revise PR #284 to include an optional else ‘else’</li>
</ul>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[10/14]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: BTW
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Anthony (Tony) Bufort (AB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Sasha Firsov (SF) [:15-]</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK) [:12-]</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Ed Porter (EP)</li>
<li class="off"><code>[&#xa0;]</code> Liam Quin (LQ)</li>
<li class="off"><code>[&#xa0;]</code> Adam Retter</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (MSM)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW). <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Happy New Year!
</p>

<p>
Proposal: Accept <a href="../../agenda/2023/01-10.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2022/12-20.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting <a href="../../agenda/2023/01-17.html">is scheduled for Tuesday, 17 January 2023</a>.
</p>

<p>
No regrets heard.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/14]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-015-02: NW to improve the width of the diagrams, perhaps multiple views</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-015-03: NW to make sure the direction of the arrow is in the legend</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-015-04: NW to investigate of a dynamic presentation is practical</li>
<li class="on"><code>[X]</code> QT4CG-016-01: DN to provide prose with more of the details for #281
Completed, reopened #299</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-02: NW to add an ed-note indicating when it was approved.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-03: RD to add a note clarifying “known character encoding”</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-04: RD to add a note clarifying the “*”/”*” html/version combination</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-05: RD to add a “todo” noting the dependency on keyword arguments</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-06: RD to reword the introduction to mapping to clarify who’s doing the mapping</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-07: NW to make an issue about the problems of document-uri uniqueness</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-08: RD to clarify how namespace comparisons are performed.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-09: RD to add a note stating that the local name should always be lowercase</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-10: RD to consider how to clarify <i>parsed</i> entity parsing.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-h-EF7A6EB3-0BDC-4E8E-A805-8461FD43964C" class="outline-3">
<h3 id="h-EF7A6EB3-0BDC-4E8E-A805-8461FD43964C"><span class="section-number-3">2.1.</span> Issue #281, reopened as #299</h3>
<div class="outline-text-3" id="text-h-EF7A6EB3-0BDC-4E8E-A805-8461FD43964C">
<p>
We had <a href="https://qt4cg.org/meeting/minutes/2022/12-13.html#issue-281">some discussion</a> of <a href="https://github.com/qt4cg/qtspecs/issues/281">#281</a> previously, but no resolution. Discussion
of this item is contingent on action QT4CG-016-01.
</p>

<ul class="org-ul">
<li>DN: I would like to thank MK and CG for very valuable feedback. I
think we probably should not try to have the discussion here. There
needs to be some more feedback before we can really discuss it.
<ul class="org-ul">
<li>… MK wanted to include partial evaluation of structured objects.
Would be good to get some feedkback from RD on this issue.</li>
</ul></li>
<li>NW: Ok, we’ll leave this open for more feedback.</li>
</ul>
</div>
</div>

<div id="outline-container-pr-parse-html" class="outline-3">
<h3 id="pr-parse-html"><span class="section-number-3">2.2.</span> Review pull request #259: parse-html (issue #74)</h3>
<div class="outline-text-3" id="text-pr-parse-html">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-259">pull request #259</a>
</p>

<p>
The proposal was <a href="https://qt4cg.org/meeting/minutes/2022/12-20.html#pr-parse-html">reviewed</a> in <a href="https://qt4cg.org/meeting/minutes/2022/12-20.html">meeting 016</a>. Discussion is expected to
continue.
</p>

<ul class="org-ul">
<li>MK: I’d like to report on the test suite.
<ul class="org-ul">
<li>… Someone pointed me to the HTML5 test suite which was too big to
use in practice. I took a sample of 1,300 test cases out of it,
chosen so that they have different tag structure. I effectively
did a majority vote on those between three supposed
implementations of the HTML5 parsing algorithm: JSoup and
Validator.nu in Java and AngleSharp in C#. After tweaking to set
options on how they deal with comments and such, they deliver the
same results in about 1,200 cases.</li>
<li>… The reference results I constructed from JSoup. Then I’ve got
two implementations one using Validator.nu and AngleSharp.</li>
<li>… Down to about 30 cases for each product that need to be
resolved.</li>
</ul></li>
<li>MSM: You said you know which one is right in some cases, does it
seem possible to induce the products producing the wrong results to
do the right thing?</li>
<li>MK: I’m using the browser to arbitrate. If I get different results,
I assume the browser is right.</li>
<li>RD: In the cases where they differ, how much does that matter in
terms of conformance?</li>
<li>MK: I think we have to live with the fact that there will be some
variation across products. Remember that this test suite was
designed to test edge cases.</li>
<li>RD: Are we going to ignore the edge cases?</li>
<li>MK: I’d recommend that we try to get the test suite to a point where
there’s a single correct result for each test. If an implementation
knows it fails a test, it can document that failure and exclude the
test.</li>
</ul>

<p>
Some discussion of a “reference implementation”. The W3C doesn’t
typically have a reference implementation, instead it publishes test
results. There’s a slight difficulty here because the HTML5 spec is
moving, but that’s true of the Unicode spec as well so we’ve learned
to cope.
</p>

<p>
Proposal: Accept the PR.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-fn-char" class="outline-3">
<h3 id="pr-fn-char"><span class="section-number-3">2.3.</span> Review pull request #261: fn:char (issue #121)</h3>
<div class="outline-text-3" id="text-pr-fn-char">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-261">pull request #261</a>
</p>

<ul class="org-ul">
<li>MK reviews #261
<ul class="org-ul">
<li>… The backslash variant is limited to “n”, and “r”, and “t”</li>
</ul></li>
<li>RD: A point on the missing bibliographic reference: my PR #259 adds
a bibiliographic reference for HTML5: The Living Standard.</li>
<li>MSM: In item 3 we allow implementations to recognize other names. I
wonder if we want to allow an imaginary DTD aware processor to allow
any general entity name.</li>
<li>RD: I don’t think we have a mechanism for bringing the DTD entities
into scope.</li>
<li>SF: That means it would be reference to implemented entities in the
environment.</li>
<li>MSM: I don’t see a lot of support, so nevermind. :-)</li>
<li>MK: I wanted to make it slightly extensible because HTML is a living
standard.</li>
<li>RD: What about the Unicode names?</li>
<li>MK: I think the database of Unicode names is just too large.</li>
<li>RD: But if you need the Unicode regex classes, those have the
Unicode names.</li>
<li>SF: What about entities defined in the document?</li>
<li>MK: This isn’t suggesting that you should get them any DTD, it’s
limited to the ones in the standard.
<ul class="org-ul">
<li>… If you’re in XSLT and you want to use entity references, then
you don’t need this function to refer directly to entities in the stylesheet’s DTD.</li>
</ul></li>
<li>MSM: In an XSLT document, or an XQuery, I don’t want entities that
are declared in the document I’m working on to be in-scope. The
entities that should be in scope are the ones in the stylesheet.
<ul class="org-ul">
<li>… If I’m going to use entity syntax (or something entity adjacent
like this function) in an XPath expression or XQuery, then I don’t
want to pick up entity names from entities that are declared for
the document I’m processing. The scoping rules are wrong.</li>
</ul></li>
<li>DN: Maybe I don’t understand, isn’t it possible for an entity to
expand to multiple characters? And what about emojis? What is a character.</li>
<li>MK: That’s a good point. I think that the HTML5 ones are all single characters.</li>
<li>NW: Maybe today but what about tomorrow?</li>
<li>RD: I know there are several that are multiple UTF-16 code points. I
can’t remember if any of them are multi-character.</li>
<li>NW: Is anything lost if we say this returns a string?</li>
<li>MK: No, I don’t think so. It raises the question of whether a single
call should be able name two characters (e.g., “\r\n”)</li>
<li>RD: I think “#xnnn” is potentially misleading because there can be
up to six numbers.</li>
</ul>

<p>
ACTION QT4CG-017-01: MK to clarify the characters numbers in points 1 and 2 of fn:char
</p>

<p>
Some discussion of how emoji fit in. 
</p>

<ul class="org-ul">
<li>MSM: If we were to allowe any Unicode names then we could use the
Unicode names for those emoji, but my instinct is that people who
are working with this function library who need to refer to an emoji
will have a hex number for it.</li>
<li>NW: I have very mixed feelings about the Unicode names. I want them
but I agree with MK about not shipping the whole database everywhere.</li>
<li>MSM: If we wanted to allow that we could rewrite rule 3 to allow
more flexibility.</li>
<li>JK: When I first read this, I didn’t understand why I needed it from
points 1 and 2. I think it would make sense to change the order so
that points 3 and 4 come first.</li>
</ul>

<p>
ACTION QT4CG-017-02: MK to change the order of points to 3, 4, 1, 2 in fn:char
</p>

<ul class="org-ul">
<li>MSM: Did I hear correctly, SF, that browsers have all the Unicode
and emoji names built in?</li>
<li>RD: I think they should do to the extent that they make use of
various Unicode libraries like ICU.</li>
<li>MK: I don’t think there’s anything in ICU that gives you access to
characters by name.</li>
</ul>

<p>
ACTION QT4CG-017-03: SF to follow up on whether or not the browser has all the Unicode and emoji names.
</p>

<p>
Proposal: accept the PR
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-grammar-if-then-else" class="outline-3">
<h3 id="pr-grammar-if-then-else"><span class="section-number-3">2.4.</span> Review pull request #284: Grammar for if-then w/o else</h3>
<div class="outline-text-3" id="text-pr-grammar-if-then-else">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-284">pull request #284</a>
</p>

<p>
Some discussion of the background, ideas from CG, RD, DN, and MK at least.
</p>

<ul class="org-ul">
<li>MK reviews 284
<ul class="org-ul">
<li>… If you want to do a conditional without an else branch, you
write an enclosed expression in curly braces.</li>
</ul></li>
<li>CG: Thank you, MK, for the proposal. Could we allow ‘else’ after the
closing curly brace?</li>
</ul>

<p>
Some concern that this re-introduces else-ambiguity. Looking at CG’s
examples in #284 clarifies that ‘else’ attachment is, after all,
unambiguous.
</p>

<p>
NW expresses confusion about why we want to have ‘else’ when we
started talking about how to avoid the ‘else’.
</p>

<ul class="org-ul">
<li>MSM: I think the reasoning for needing this is that I’ve got an
elseless condition and I decide that I need to add an else. I wrote
it with braces, so it’ll feel simpler if I don’t have to undo the
braces and add the keyword. For people who want elseless-ifs also
going to want do without the ‘else’ keyword?</li>
<li>RD: Being able to omit the ‘else’ is useful because you often end up with
lots of <code>else ()</code>.</li>
</ul>

<p>
Some discussion of whether or not there’s ambiguity in the grammar. We
don’t have anyone doing rigorous analysis.
</p>

<p>
ACTION QT4CG-017-04: MK to revise PR #284 to include an optional else ‘else’ 
</p>

<ul class="org-ul">
<li>SF: Perhaps we should try to compare our grammar to other languages
common in our ecosystem like Java, Typescript, etc.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
